[
  "Pray for my children that God will be at work within them both to will and to do according to His good pleasure (Phil. 2:13).",
  "Pray for my children that God will be the center of their home and that this will become evident to others.",
  "Pray for my children that God will cultivate godliness and the same traits already mentioned within them.",
  "Pray for my children that God will grant them a sense of excellence in doing things unto the glory of God in the everyday activities of their lives (1 Thess. 4:1 and 4:10; 1 Cor. 10:31; 2 Cor. 1:20).",
  "Pray for my children that God will grant them an insatiable hunger and thirst for Him and His Word (1 Pet. 2:1–2).",
  "Pray for my children that God will protect them from themselves, violent people and the evil one. (I received these three prayer requests from a godly uncle of mine who has since gone home to be with the Lord).",
  "Pray for my children that God will raise up godly influences for them, and",
  "Pray for my children that God would bring them to a godly, Bible-centered church, where they may grow in their walks with the Lord, both individually and collectively.",
  "Pray for my children that my daughter will become a Proverbs 31 woman and my son an Ephesians 5 man whether God grants them spouses or not.",
  "Pray for my children that their hearts will always be inclined to God (Josh. 24:23).",
  "Pray for my children that their hearts will always be tender before God (2 Chron. 34:27).",
  "Pray for my children that they grow in favor with God and man (Luke 2:52).",
  "Pray for my children that they grow in the grace and knowledge of their Lord and Savior Jesus Christ (2 Pet. 3:18), and",
  "Pray for my children that they will become godly influences.",
  "Pray for my children that they will come to a saving grace of God early in their lives (1 Sam. 3:7).",
  "Pray for my children that they will come under strong conviction when they sin (Ps. 51), and",
  "Pray for my children that they will confess their sins to God (1 John 1:9) and to others (James 5:16).",
  "Pray for my children that they will fear God and turn away from evil (Job 1:8).",
  "Pray for my children that they will have a Second Coming mentality (1 John 3:1­–3).",
  "Pray for my children that they will have godly friends and be godly friends to others.",
  "Pray for my children that they will honor Him in the courtship and keep them pure before Him.",
  "Pray for my children that they will know experientially that He alone is worthy to receive all glory, honor and praise and live their lives accordingly (Rev. 4:11; Rev. 5:1–11).",
  "Pray for my children that they will live their lives with eternity in view (Phil. 3:20–21).",
  "Pray for my children that they will not be conformed to this world, but instead they will be transformed by the renewing of their minds (Rom. 12:1–2) and the washing of water with the Word (Eph. 5:26).",
  "Pray for my children that they will walk with God all the days of their lives (Judges 2:7; 1Sam. 1:11; Ps. 23:6), and",
  "Pray for my children that they will worship God in spirit and truth frequently (John 4:23–24).",
  "Pray for my children that true biblical Wisdom will be their close associate (Prov. 1-9; 1Cor. 1:22-24; 1Cor. 1:30).",
  "Pray for my children that we will see the fruits of a lifetime of walking with Jesus before His throne (Rev. 4:9–11).",
  "I pray that you would fill me with your Spirit so that my life bears fruit through loving deeds for others.",
  "I pray that I would hold loosely to all that you have given me and to know that my home, my food, my time and everything else belong to you. Help me to be a faithful steward of all of them.",
  "I pray that you would give me boldness to welcome others as you have welcomed me.",
  "I pray that the motivation of my heart would be that, through loving others, I might express my love for Christ. Please give me great joy and freedom in hospitality.",
  "I pray, Father, that you would make me more like your Son in every area of my life.",
  "I pray that you would not let there be blind spots in my life and, if there have been, that you would give me the grace to see them and turn from my sin.",
  "I pray that I would take full advantage of your means of grace so through them I can become more like Christ.",
  "I pray that you would help me be the servant of all and thus pursue true greatness.",
  "I pray that you would fill me with your Spirit so that self-control reigns in my heart and life. (Galatians 5:23)",
  "I pray that you would help me to put others first so that I do not think of myself more highly than I ought to think. Help me to think with appropriately sober judgment. (Philippians 2:3; Romans 12:3)",
  "I pray that you would help me to be slow to anger so that I might have mastery over my temper. (Proverbs 16:32)",
  "I pray that others would ask me about the hope within me because of my joyful, respectful life. (1 Peter 3:14–17)",
  "I pray that you would make me more like Christ so that I may be gentle just like he is gentle. I pray that I would regularly consider all the ways in which you have been so patient and gentle with me.",
  "I pray that you would give me the grace to be patient and calm when others attack and misunderstand me. Help me respond with gentleness even in the most difficult circumstances.",
  "I pray that I would display the gospel in the way I love, lead, and care for my children.",
  "I pray that I would have a deeper understanding of what it means that God is my Father so I can imitate him in the way I care for my children.",
  "I pray that you would help me show my children that I love them in both tough and tender ways.",
  "I pray that you would make me a faithful and patient leader in my home."  
]