[
  "What steps can you take to closer align your obedience with your doctrine?",
  "How can I be praying for my wife?",
  "How can I be praying for my kids",
  "What areas of my life am I working my godliness?",
  "What are some heart-focused, gospel-centered talking points you can engage with your kids today?",
  "What does your child love in the creation? How can you show him or her God's glory through that?",
  "In what ways have you failed to mirror the authority of God this week?",
  "How have you acted self-righteously as a parent? Why are you and your kid more alike than different?",
  "How would you have desired, spoke, or acted differently in that moment if your heart was captured by God's glory?",
  "Which of your desires, words or actions this week have revealed your lack of zeal for the glory of God?",
  "Am I spending time slowly reading God’s word and memorizing Scripture?",
  "Am I having consistent, focused, extended times of prayer, including interceding for others?",
  "Am I disciplined in my use of technology",
  "Am I patient with my kids or am I angry with them when they disobey or behave in childish ways?",
  "When at home, am I “fully present” for my wife and family or are my mind and energy elsewhere?",
  "Have I done anything out of the ordinary to cherish and help my wife?",
  "Think of at least 2 people in your neighborhood with whom you interact with regularly. In what ways have you neglected to see and engage them as people?",
  "Are you content — more than content, delighted and exhilarated — to have God at your side (Joshua 1:9)?",
  "Have you put some earthly standard or accomplishment ahead of knowing him and being his (2 Corinthians 6:16)?",
  "Are you willing to entrust your soul, your cause, and your vindication to the one who always judges justly, the one who has promised to work all things in every circumstance — including every setback, every disappointment, and even every sin against you — for you (1 Peter 2:23; Romans 8:28)?",
  "What evidences of humility in Christ do you see?",
  "How does the cross serve as an anecdote for our pride?",
  "What makes Jesus more worthy of the center than we are?"
]
